app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aaa"], ["body", "bbb"], ["user_id", 2], ["created_at", "2021-06-08 04:52:45.753690"], ["updated_at", "2021-06-08 04:52:45.753690"]]
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save